#                           השמת ערכים "שלם ,שבר עשרוני ומחרוזת לתוך תא
#a=5           #השמת ערך לתא
#print(a)      #פלט הערך של תא
#b=6           #השמת ערך לתא
#a=b           #השמת ערך של תא בי לתוך איי
#print(a)      #פלט של ערך תא איי-התוצאה 6
#print(b)      #פלט של תא בי - התוצאה 6
#print(a,b)    #פלט של ערכי 2 תאים זה לצד זה

#***************************************************

a="moti "
print(a)

b='yair'
print(b)

print("my name is: ",a,b)

#***************************************************
a="moti "            #השמת מחרוזת לתא
print(a)             #פלט הערך של תא

b='yair'             #השמת מחרוזת לתא
print(b)             #פלט הערך של תא

print("my name is: ",a,b)  #פלט הערך של תא

#                              ערכים בולייאנים
#a=5          #השמת ערך לתא
#b=3          #השמת ערך לתא
#x=True       #תא איקס הוא בולייאני
#x=a==b       #שאלתי:האם איי=בי ? התשובה שחזרה היא שקר
#print(x)     #פלט בולייאני של התא

#אפשר להשוות גם בין מחרוזות
#a="abcd"    #השמת מחרוזת לתא
#b="c"       #השמת מחרוזת לתא
#x=True      #תא איקס הוא בולייאני
#x=b in a    #שאלתי האם בי נמצא בתוך איי? התשובה שחזרה היא אמת
#print(x)    #פלט בולייאני של התא

#אפשר להשוות גם בין מחרוזות
#a="abcd"    #השמת מחרוזת לתא
#b="c"       #השמת מחרוזת לתא
#x=True      #תא איקס הוא בולייאני
#x=a in b    #האם איי בתוך בי? התשובה שחזרה היא שקר
#print(x)    #פלט בולייאני של התא

#***************************************************

#                               קבלת קלט מהמשתמש
#input("your name is: ")   # המחשב מקליד את המשפט והמשתמש מקליד את שמו

#הכנסת פעולת קלט לתוך תא
#חיסכון בכתיבה
#name=input("your name is: ")    #לאחר הקלדת שם המשתמש ,שמו יישמר לתאכמחרוזת
#print("Hi",name,"how are you today ?") #שילוב המחרוזת של שם המשתמש במשפט

#***************************************************

#                                הסבת טיפוסים של משתנים
#number=input("enter a number: ")   #השמת ההקלדה של המשתמש לתא שהו מחרוזת
#print(int(number)+1)    # הסבת טיפוס מחרוזת לטיפוס מספר שלם

#number=input("enter a number: ")   #השמת ההקלדה של המשתמש לתא שהו מחרוזת
#print(float(number)+1)             #הסבת טיפוס מחרוזת לטיפוס שבר עשרוני

#number=input("enter a number: ")   #השמת ההקלדה של המשתמש לתא שהו מחרוזת
#print(float(number)**3)            #הסבת טיפוס מחרוזת לטיפוס שבר עשרוני בחזקת 3


#החלפת ערכים בין תאים
#prati="moti"                    #השמת מחרוזת לתא
#mishpaha="yair"                 #השמת מחרוזת לתא
#prati,mishpaha=mishpaha,prati   #החלפת הערכים בין התאים
#print(prati)                    #פלט השם הפרטי - התוצאה יאיר
#print(mishpaha)                 #פלט שם המשפחה - התןצאה מוטי

#מזהה סוגים של אובייקטים
list=["1","2","3","4","5","6"]  #רשימה
x=list[0::2]                    #רשימה
t= ", ".join(x)                 #מחרוזת
z = list[-1]                    #מחרוזת
a=3                             #מספר שלם
b=float(3)                      #מספר עשרוני
c=True                          #בוליאני
print(c)
print(type(c))






















