#דוגמאות ללולאת פור

# a=[1,2,3,4,5,6]                                 #רשימת מספרים
# for i in a:                                     #הרצת מונה על כל איברי הרשימה
#     print(i)                                    #והדפסתם
# print("the sum of a[0]+a[1] is: ",a[0]+a[1])    #הדפסת סכום מספרים בתוך הרשימה


# b=["1","2","3","4","5","6"] #רשימת מחרוזות
# for i in b:                 #הרצת מונה על כל איברי הרשימה
#     print(i)                #והדפסתם
# print(b[0]+b[1])            #הדפסת 2 המחרוזות הראשונות בצמידות


# for i in "moti":              #ריצה על כל תווי המחרוזת
#   print(i)                    #והדפסתם


# for i in "moti":              #ריצה על כל תווי המחרוזת
#   print(i)                    #והדפסתם
#   if i=="t":                  #בדיקה אם התו הוא טי
#     break                     #אם-כן הריצה מפסיקה(התו איי לא יודפס)


# for i in "moti":              #ריצה על כל תווי המחרוזת
#   if i=="t":                  #בדיקה אם התוו הוא טי
#     break                     #אם כן-תופסק הריצה
# print(i)                      #ויודפס התו האחרון - טי


# for i in "moti":                #ריצה על כל תווי המחרוזת
#   if i=="t":                    #בדיקה אם התו הוא טי
#     break                       #אם כן-תופסק הריצה
#   else:                         #אחרת-יודפס התו
#     print(i)                    #יודפסו התווים עד התו טי


# for i in "moti":              #ריצה על כל תווי המחרוזת
#   if i=="t":                  #בדיקה אם התוו הוא טי
#     continue                  #אם כן-תמשיך הריצה
#   print(i)                    #ותדפיס את כל התווים חוץ מטי


# c=["1",2,"3",4,"5",6]           #רשימה מעורבת של מחרוזות ומספרים
# for i in c:                     #הרצת מונה על כל איברי הרשימה
#     print(i)                    #והדפסתם
# print(c[0]+c[1])                #אינו יכול לחבר מחרוזת למספר שלם


# for i in range (6):         # ריצה כברירת מחדל מאפס עד חמש-ללא קשר לרשימה כלשהי
#     print(i)                #והדפסתם


# for x in range(2,7):        #ריצה החל מ2 עד-וכולל 6
#   print(x)                  #והדפסתם


# for x in range(2,7,2):        #בדילוגים של 2 ריצה החל מ2 עד-וכולל 6
#   print(x)                    #והדפסתם


#                                 #לולאת איף לא מחייבת אלס
#                                 #בדוגמא זו לולאת אלס מגיעה מתחת לפור
# for x in range(6):              #ריצה על מספרים
#   if x == 3:                    #אם המספר שווה ל 3
#     break                       #הלולאה תתבצע עד שתגיע למספר 3
#   print(x)                      #תדפיס רק את המספרים מ 0 עד 2
# else:                           #לאחר ברייק לא תגיע לכאן
#   print("Finally finished!")


#                                 #לולאת איף לא מחייבת אלס
#                                 #בדוגמא זו לולאת אלס מגיעה מתחת לפור
# for x in range(6):              #ריצה על מספרים
#   if x == 30: break             #הלולאה לא תגיע ל 30 ולכן תתבצע עד המספר 5
#   print(x)                      #ותדפיס את כולם
# else:                           #אחרת
#   print("Finally finished!")    #תדפיס גם את המשפט