

# word=input("enter a word  ")     #קלט של מחרוזת
# print(word[0])                   # פלט - התו הראשון משמאל
# print(word[-2])                  #פלט-התו השני מימין
#Word=input("Enter a String  ")    #קלט של מחרוזת
#print(Word[0:2])                  #יציג את האות במקום הראשון וגם השני
#print(Word[0:5:2])                #ללא קשר לאורך המחרוזת,יחתוך עד מיקום 5 וירשום קפיצות של 2
#print(Word[:])                    #הצגת כל המחרוזת
#print(Word[::4])                  #ללא קשר לאורך המחרוזת,פלט של האות במקום האפס ובקפיצות של 4
#print(Word[::1])                  #ללא קשר לאורך המחרוזת - הצגת כל האותיות- כי הקפיצה ב1
#print(Word[1:3])                  #יציג את האות במיקום 1  וגם 2
#print(Word[::-1])                 #יציג את המחרוזת הפוכה-מימין לשמאל ללא דילוגים כי מינוס 1
#print(Word[-2::-4])               #יתחיל מהמקום השני מימין ,ירשום אותו וידלג כל ארבעה מקומות
#print(Word.find('12'))            #יחפש את הצירוף המצויין

