 #  - מערך שיעור רשימות

#1
# x=[1,2]
# print(x)                        #הצגת הרשימה-עם סוגריים מרובעים

#2
# x=[1,2]
# print(x*2)                        # הצגת הרשימה-עם סוגריים מרובעים - פעמיים כרשימה אחת

#3
# x=[1,2]
# y=[3,4]
# print(x+y)                      #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים

#4
# x=[1,2]
# y=[3,4]
# print(x+y*2)                      #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים אך רשימה וואי מוכפלת

#5
# x=[1,2]
# y=[3,4]
# print((x+y)*2)  #                     #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים מוכפלת

#6
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x+y+z)                    #שילוב 3 הרשימות כרשימה אחת - עם סוגריים מרובעים

#לתרגל הכפלת כל רשימה וגם את כל הרשימות-סדר פעולות 7

#8
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0]+y[0]+z[0])           #תוצאת חיבור האיברים

#9
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0]*2+y[0]*3+z[0]/5)           #תוצאת תרגיל בין איברי הרשימות 

#10
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(2*(x[0]*2+y[0]*3+z[0]/5))        

#11
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[1],y[1],z[0])           #הצגת האיברים - ללא הסוגריים המרובעים

#12
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0],y[1],z[2])           #הודעת שגיאה - מחוץ לתחום

#13
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(2*(x[1]*2+y[1]*3+z[0]/5))   

x=[1,2,3]

print(len(x))

