#print("me".upper())                               #מי הוא האובייקט של המתודה אפר 
                                                   # הפלט - המחרוזת באותיות גדולות
						
#print("1".zfill(5))                               # 1הוא האובייקט של המתודה זדפיל,כלומר זירופיל,לרפד את המספר באפסים לפי הפרמטר 5 
                                                   #הפלט - 00001

#print("2".zfill(3))                               # 3 הוא האובייקט של המתודה זדפיל,כלומר זירופיל,לרפד את המספר באפסים לפי הפרמטר  
                                                   # הפלט - 0002

#text=input("Enter a String : ")                   #הודעה לקלט של מחרוזת שנכנסת לתא טקסט
#x=text.replace("a","d")                           #החלפת התו איי בתו די
#print(x)                                          #פלט כל האיי הוחלף בדי

#text=input("Enter a String : ")                    #הודעה לקלט של מחרוזת שנכנסת לתא טקסט
#y = text[::-1]                                     #המחרוזת נכנסת הפוכה לתא וואי
#x=text==y                                          # שאלתי האם טקסט וואי זהים
#print("The String You Chose is ",x, " Palimdrom")  # פלט של הודעה באם המחרוזת היא פלינדרום-כלומר ניתנת לקריאה גם מימין לשמאל

x = (input("enter temp :"))
C = (5*float(x)-160)/9 
F =  (9*float(C)+160)/5                                      
print(C)
print(F)  