                                  #חישוב שורשי משוואה ריבועית

import math                                       #קריאה לספריית מאט
def Squre_Root(a,b,c):                        #הגדרת פונקציה עם 3 משתנים
	a = float(a)                              #ווידוא שאיי הוא מספר
	b = float(b)                              #ווידוא שבי הוא מספר
	c = float(c)                              #ווידוא שסי הוא מספר
	delta = b**2-4*a*c                        # הביטוי מתחת לשורש נכנס לתא דלתא
	if delta < 0:                             #בדיקה האם דלתא קטנה מאפס
		print("a=",a,"  b=",b,"  c=",c)       #פלט -דיווח על המקדמים
		print("It's a Math Error")            #פלט-הודעת שגיאה מתימטית-כי לא ניתן לחשב שורש של מספר שלילי
	elif delta == 0:	                      #אחרת-אם
		x1 = (-b + math.sqrt( delta))/2*a     #חישוב שורש
		print("a=",a,"  b=",b,"  c=",c)       #פלט -דיווח על המקדמים
		print("The Single Root is: ",x1)	  #פלט -דיווח על השורשים
	else:                                     #אחרת
		x1 = (-b + math.sqrt( delta))/(2*a)   #חישוב שורש ראשון
		x2 = (-b - math.sqrt( delta))/(2*a)   #חישוב שורש שני
		print("a=",a,"  b=",b,"  c=",c)       #פלט -דיווח על המקדמים
		print("The  2 Roots are: ",x1," , ",x2)      #פלט -דיווח על השורשים

Squre_Root("5","-30","-35")                          #קריאה לפונקציה והשמת ערכים



