#  - מערך שיעור רשימות
#פעולות מתימטיות על רשימות
#1
# x=[1,2]
# print(x)                        #הצגת הרשימה-עם סוגריים מרובעים

# [1, 2]                    #פלט


#2
# x=[1,2]
# print(x*2)                        # הצגת הרשימה-עם סוגריים מרובעים - פעמיים כרשימה אחת

# [1, 2, 1, 2]              #פלט


#3
# x=[1,2]
# y=[3,4]
# print(x+y)                      #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים

# [1, 2, 3, 4]              #פלט



#4
# x=[1,2]
# y=[3,4]
# print(x+y*2)                      #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים אך רשימה וואי מוכפלת

# [1, 2, 3, 4, 3, 4]        #פלט


#5
# x=[1,2]
# y=[3,4]
# print((x+y)*2)  #                     #שילוב 2 הרשימות כרשימה אחת - עם סוגריים מרובעים מוכפלת

# [1, 2, 3, 4, 1, 2, 3, 4]  #פלט


#6
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x+y+z)                    #שילוב 3 הרשימות כרשימה אחת - עם סוגריים מרובעים

# [1, 2, 3, 4, 5, 6]        #פלט


#לתרגל הכפלת כל רשימה וגם את כל הרשימות-סדר פעולות 7

#8
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0]+y[0]+z[0])           #תוצאת חיבור האיברים

# 9                         #פלט



#9
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0]*2+y[0]*3+z[0]/5)           #תוצאת תרגיל בין איברי הרשימות 

# 12.0                      #פלט



#10
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(2*(x[0]*2+y[0]*3+z[0]/5))        

# 24.0                      #פלט

#11
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[1],y[1],z[0])           #הצגת האיברים - ללא הסוגריים המרובעים

# 2 4 5                     #פלט


#12
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(x[0],y[1],z[2])           #הודעת שגיאה - מחוץ לתחום

# IndexError: list index out of range   #פלט

#13
# x=[1,2]
# y=[3,4]
# z=[5,6]
# print(2*(x[1]*2+y[1]*3+z[0]/5))   

# 34.0                  #פלט



